In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a', 'b', 'c']

In [3]:
myList = [10, 20, 30]
arr = np.array([10,20,30])
d = {'a':10, 'b':20, 'c':30}

In [7]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [9]:
salesQ1 = pd.Series(data = [250,450,200,150],index=['USA', 'China', 'India', 'Brazil'])

In [10]:
salesQ1

USA       250
China     450
India     200
Brazil    150
dtype: int64

In [11]:
salesQ2 = pd.Series(data = [260,500,210,100],index=['USA', 'China', 'India', 'Japan'])

In [1]:
 columns = ['W','X','Y','Z']
    index = ['A', 'B','C','D']

IndentationError: unexpected indent (4127423723.py, line 2)

In [2]:
 columns = ['W','X','Y','Z']
index = ['A', 'B','C','D']

In [3]:
index

['A', 'B', 'C', 'D']

In [4]:
index = ['A', 'B','C','D','E']

In [5]:
from numpy.random import randint

In [7]:
np.random.seed(42)
data = randint(-100,100,(5,4))

NameError: name 'np' is not defined

In [8]:
import numpy as np
import pandas as pdZ

In [9]:
import pandas as pd

In [10]:
np.random.seed(42)
data = randint(-100,100,(5,4))

In [11]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [12]:
df = pd.DataFrame(data, index, columns)

In [13]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
df[['W','Z']]

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

In [18]:
df['new'] = df['W'] + df['Y']

In [19]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [20]:
df.drop('new',1)

/var/folders/vp/h9397tqn6373kx1nb5kddrz80000gn/T/ipykernel_76625/2122723242.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  df.drop('new',1)

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [21]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [22]:
df = df.drop('new',axis=1)

In [23]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [26]:
df.loc[['A','E']]

    W   X   Y   Z
A   2  79  -8 -86
E  30  49 -48 -99

In [27]:
df.iloc[2]

W     2
X    21
Y   -26
Z   -13
Name: C, dtype: int64

In [28]:
df.iloc[1:3]

   W   X   Y   Z
B  6 -29  88 -80
C  2  21 -26 -13

In [29]:
df.drop('C')

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
D  16  -1   3  51
E  30  49 -48 -99

In [30]:
df.loc['A','W']

2

In [31]:
df.loc[['A','C'],['W','Y']]

   W   Y
A  2  -8
C  2 -26

In [32]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [33]:
df > 0

      W      X      Y      Z
A  True   True  False  False
B  True  False   True  False
C  True   True  False  False
D  True  False   True   True
E  True   True  False  False

In [34]:
ac = df > 0

In [35]:
ac

      W      X      Y      Z
A  True   True  False  False
B  True  False   True  False
C  True   True  False  False
D  True  False   True   True
E  True   True  False  False

In [36]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [37]:
df[df > 0]

    W     X     Y     Z
A   2  79.0   NaN   NaN
B   6   NaN  88.0   NaN
C   2  21.0   NaN   NaN
D  16   NaN   3.0  51.0
E  30  49.0   NaN   NaN

In [38]:
df['X']>0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [43]:
df[df['X']>0]

    W   X   Y   Z
A   2  79  -8 -86
C   2  21 -26 -13
E  30  49 -48 -99

In [48]:
df[(df['W'] > 0) | (df['Y'] > 1)]

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [50]:
df.reset_index()

  index   W   X   Y   Z
0     A   2  79  -8 -86
1     B   6 -29  88 -80
2     C   2  21 -26 -13
3     D  16  -1   3  51
4     E  30  49 -48 -99

In [51]:
new_ind = ['CA','NY','WY','OR','CO']

In [52]:
df['States'] = new_ind

In [53]:
df

    W   X   Y   Z States
A   2  79  -8 -86     CA
B   6 -29  88 -80     NY
C   2  21 -26 -13     WY
D  16  -1   3  51     OR
E  30  49 -48 -99     CO

In [56]:
df = df.set_index('States')

In [57]:
df

         W   X   Y   Z
States
CA       2  79  -8 -86
NY       6 -29  88 -80
WY       2  21 -26 -13
OR      16  -1   3  51
CO      30  49 -48 -99

In [58]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [59]:
df.describe()

              W          X          Y          Z
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000
std    11.96662  42.109381  51.915316  63.366395
min     2.00000 -29.000000 -48.000000 -99.000000
25%     2.00000  -1.000000 -26.000000 -86.000000
50%     6.00000  21.000000  -8.000000 -80.000000
75%    16.00000  49.000000   3.000000 -13.000000
max    30.00000  79.000000  88.000000  51.000000

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      int64
 1   X       5 non-null      int64
 2   Y       5 non-null      int64
 3   Z       5 non-null      int64
dtypes: int64(4)
memory usage: 200.0+ bytes

In [61]:
df = pd.DataFrame({'A':[1,2,np.nan,4],
                  'B':[5,np.nan,np.nan,8],
                  'C':[10,20,30,40]})

In [62]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [67]:
df.dropna(axis=1,thresh=3)

     A   C
0  1.0  10
1  2.0  20
2  NaN  30
3  4.0  40

In [69]:
df.fillna(value='FILL VALUE')

            A           B   C
0         1.0         5.0  10
1         2.0  FILL VALUE  20
2  FILL VALUE  FILL VALUE  30
3         4.0         8.0  40

In [70]:
df.dtypes

A    float64
B    float64
C      int64
dtype: object

In [73]:
df['A'] = df['A'].fillna(value=0)

In [74]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  0.0  NaN  30
3  4.0  8.0  40

In [77]:
df['B'] = df['B'].fillna(df['B'].mean())

In [78]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  6.5  20
2  0.0  6.5  30
3  4.0  8.0  40

In [79]:
df.fillna(df.mean())

     A    B   C
0  1.0  5.0  10
1  2.0  6.5  20
2  0.0  6.5  30
3  4.0  8.0  40

In [83]:
df.iloc[2,0] = np.nan

In [84]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  6.5  20
2  NaN  6.5  30
3  4.0  8.0  40

In [85]:
df = df.fillna(df.mean())

In [86]:
df

          A    B   C
0  1.000000  5.0  10
1  2.000000  6.5  20
2  2.333333  6.5  30
3  4.000000  8.0  40

In [1]:
import pandas as pd
df_one = pd.DataFrame({'k1':['A','A','B','B','C','C'],
                      'col1':[100,200,300,300,400,500],
                      'col2':['NY','CA','WA','WA','AK','NV']})

In [2]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [6]:
df_one['k1'].value_counts()

A    2
B    2
C    2
Name: k1, dtype: int64

In [7]:
df_one['col2'].unique()

array(['NY', 'CA', 'WA', 'AK', 'NV'], dtype=object)

In [8]:
df_one.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [9]:
df_one['NEW'] = df_one['col1'] * 10

In [10]:
df_one

  k1  col1 col2   NEW
0  A   100   NY  1000
1  A   200   CA  2000
2  B   300   WA  3000
3  B   300   WA  3000
4  C   400   AK  4000
5  C   500   NV  5000

In [11]:
def grab_first_letter(state):
    return state[0]

In [12]:
grab_first_letter('NEW')

'N'

In [16]:
df_one['firstLetter'] = df_one['col2'].apply(grab_first_letter)

In [17]:
df_one

  k1  col1 col2   NEW firstLetter
0  A   100   NY  1000           N
1  A   200   CA  2000           C
2  B   300   WA  3000           W
3  B   300   WA  3000           W
4  C   400   AK  4000           A
5  C   500   NV  5000           N

In [18]:
def complex_letter(state):
    if state[0] == 'W':
        return 'Washington'
    else:
        return 'Error'

In [19]:
df_one['col2'].apply(complex_letter)

0         Error
1         Error
2    Washington
3    Washington
4         Error
5         Error
Name: col2, dtype: object

In [20]:
df_one['k1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: k1, dtype: object

In [21]:
my_map = {'A':1, 'B':2, 'C':3}

In [23]:
df_one['num'] = df_one['k1'].map(my_map)

In [24]:
df_one

  k1  col1 col2   NEW firstLetter  num
0  A   100   NY  1000           N    1
1  A   200   CA  2000           C    1
2  B   300   WA  3000           W    2
3  B   300   WA  3000           W    2
4  C   400   AK  4000           A    3
5  C   500   NV  5000           N    3

In [29]:
df_one['col1'].idxmin()

0

In [33]:
df_one.sort_values('col2', ascending=False)

  k1  col1 col2   NEW firstLetter  num
2  B   300   WA  3000           W    2
3  B   300   WA  3000           W    2
0  A   100   NY  1000           N    1
5  C   500   NV  5000           N    3
1  A   200   CA  2000           C    1
4  C   400   AK  4000           A    3

In [34]:
features = pd.DataFrame({'A':[100,200,300,400,500],
                        'B':[12,13,14,15,16]})
predictions = pd.DataFrame({'pred':[0,1,1,0,1]})

In [35]:
features

     A   B
0  100  12
1  200  13
2  300  14
3  400  15
4  500  16

In [36]:
predictions

   pred
0     0
1     1
2     1
3     0
4     1

In [37]:
 pd.concat([features, predictions], axis=1)

     A   B  pred
0  100  12     0
1  200  13     1
2  300  14     1
3  400  15     0
4  500  16     1

In [39]:
df_one['k1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: k1, dtype: object

In [40]:
pd.get_dummies(df_one['k1'])

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1

In [41]:
import numpy as np

In [43]:
pwd

'/Users/praneethbandi'

In [44]:
df = pd.read_csv('/Users/praneethbandi/TF_2_Notebooks_and_Data/01-Pandas-Crash-Course/example.csv')

In [45]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [46]:
cd TF_2_Notebooks_and_Data

/Users/praneethbandi/TF_2_Notebooks_and_Data

In [47]:
ls

00-NumPy-Crash-Course/         07-AutoEncoders/
01-Pandas-Crash-Course/        08-GANs/
02-Visualization-Crash-Course/ 09-Deployment/
03-ANNs/                       DATA/
04-CNNs/                       Pierian_Data_Logo.png
05-RNNs/                       README.md
06-NLP-and-Text-Data/

In [48]:
cd 01-Pandas-Crash-Course

/Users/praneethbandi/TF_2_Notebooks_and_Data/01-Pandas-Crash-Course

In [49]:
ls

00-Intro-to-Pandas.ipynb             08-Pandas-Exercises-Solutions.ipynb
01-Series.ipynb                      Excel_Sample.xlsx
02-DataFrames.ipynb                  Universities.csv
03-Missing-Data.ipynb                Untitled.ipynb
04-Groupby.ipynb                     african_econ_crises.csv
05-Operations.ipynb                  bank.csv
06-Data-Input-and-Output.ipynb       example.csv
07-Pandas-Exercises.ipynb            output.csv

In [50]:
df2 = pd.read_csv('example.csv')

In [51]:
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [52]:
df.to_csv('output.csv', index=False)

In [53]:
ls

00-Intro-to-Pandas.ipynb             08-Pandas-Exercises-Solutions.ipynb
01-Series.ipynb                      Excel_Sample.xlsx
02-DataFrames.ipynb                  Universities.csv
03-Missing-Data.ipynb                Untitled.ipynb
04-Groupby.ipynb                     african_econ_crises.csv
05-Operations.ipynb                  bank.csv
06-Data-Input-and-Output.ipynb       example.csv
07-Pandas-Exercises.ipynb            output.csv